Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hcsr04/src/rx_hcsr04_isr.c
/* star-rx72n-firmware/libs/rx_hcsr04/src/rx_hcsr04_isr.c */

/**
 * @file rx_hcsr04_isr.c
 * @brief HC-SR04 ISR (Interrupt Service Routine) Handler Implementation
 *
 * @details
 * Implements ISR handlers for HC-SR04 ultrasonic sensors operating in IRQ mode.
 * Captures rising and falling edge timestamps with microsecond precision.
 *
 * **ISR Design:**
 * - Keep ISR execution time minimal (< 5us)
 * - No blocking operations in ISR
 * - No ThreadX calls in ISR (use TX_INTERRUPT_SAVE_AREA if needed)
 * - Clear interrupt flag before exit
 *
 * @par NASA Power of 10 Compliance
 * - Rule 1: No goto, no recursion, all control flow via if/for/while
 * - Rule 2: No unbounded loops; ISR is O(1), rx_hcsr04_isr_get_duration returns immediately
 * - Rule 3: No dynamic allocation; all storage is static arrays
 * - Rule 4: All functions < 30 lines (internal_irq_handler: 25 lines)
 * - Rule 5: 2+ NULL checks and range validations per public function
 * - Rule 7: All register writes validated; all return values checked
 * - Rule 8: All constants are named C23 typed enums (isr_constants_t)
 * - Rule 10: Compiled with -Wall -Wextra -Werror
 *
 * @par SOLID Principles
 * - Single Responsibility: ISR state capture only; ICU config in rx_hcsr04_icu,
 *                          driver logic in rx_hcsr04.c
 * - Dependency Inversion: Uses hcsr04_hal_get_time_us_isr() abstraction (mutex-free, ISR-safe)
 *
 * @author STAR Team
 * @date 2026-02-16
 * @copyright Copyright (c) 2026 Locked Inc.
 * SPDX-License-Identifier: MIT
 * @since Version 1.0.0
 * @version 1.0.0
 *
 * @see docs/sections/06_nasa_power_of_10.tex NASA Power of 10 rules applied in this module
 * @see docs/sections/01_nanopb_protocol.tex System architecture and design document
 */

#include "rx_hcsr04_isr.h"

#include "rx72n_icu_regs.h"
#include "rx72n_port_regs.h"
#include "rx_check.h"
#include "rx_hcsr04_hal.h"

/* =============================================================================
 * Constants
 * =============================================================================
 */

/**
 * @enum isr_constants_t
 * @brief ISR configuration and state machine constants
 *
 * @details
 * Named constants for ISR (Interrupt Service Routine) logic. All magic
 * literals in this module must reference this enum.
 *
 * **Sensor Map:**
 * s_sensor_map[] has k_sensor_map_size entries. Entries initialized to
 * k_sensor_unused and set via rx_hcsr04_isr_register(). Only indices
 * [k_irq_min..k_irq_max] (8-11) are valid IRQ numbers.
 *
 * **IRQ Handler:**
 * Pin state is read from PORT0->PIDR register; the pin bit is extracted
 * by shifting right by (irq_num - k_irq_min), then masking with k_pin_state_mask.
 *
 * @invariant k_sensor_map_size > k_irq_max (map covers all valid IRQ indices)
 * @invariant k_irq_count == k_irq_max - k_irq_min + 1 == 4
 *
 * @code
 * // Typical ISR handler using these constants:
 * void INT_IRQ11(void)
 * {
 *     internal_irq_handler(k_irq_max);  // IRQ11 = max IRQ
 * }
 *
 * // Validate IRQ number before indexing:
 * if (irq_num < k_irq_min || irq_num > k_irq_max) { return k_rx_err_invalid_arg; }
 * const uint8_t idx = irq_num - k_irq_min;  // IRQ8->0, IRQ11->3
 * @endcode
 *
 * @see internal_irq_handler() Uses k_vector_base, k_irq_min, k_pin_state_mask
 * @see rx_hcsr04_isr_register() Uses k_sensor_map_size as array bound
 *
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_irq_min         = 8,  /**< Minimum IRQ number (IRQ8 = P00) */
  k_irq_max         = 11, /**< Maximum IRQ number (IRQ11 = P03; only ISR handlers IRQ8-11 exist) */
  k_irq_count       = k_irq_max - k_irq_min + 1, /**< Number of supported IRQs (4: IRQ8-11) */
  k_vector_base     = 64,                        /**< IRQ vector base (IRQ0 = vector 64) */
  k_sensor_unused   = 0xFF,                      /**< Sentinel: sensor slot not assigned */
  k_sensor_map_size = 16,                        /**< Total entries in s_sensor_map (IRQ0-15) */
  k_pin_state_mask  = 0x01,                      /**< Bit mask to extract single pin state */
  k_ir_flag_clear   = 0, /**< Write 0 to IR register to clear pending interrupt flag */
} isr_constants_t;

/**
 * @enum isr_timer_constants_t
 * @brief CMT2 timer wrap period for ISR timestamp correction
 *
 * @details
 * The CMT2 16-bit counter wraps every 65536 ticks at PCLKB/8 = 7.5 MHz.
 * Wrap period = 65536 / 7500000 s = ~8738 us. hcsr04_hal_get_time_us_isr()
 * returns values in [0, 8738]. When the falling edge timestamp wraps around
 * to a value smaller than the rising edge timestamp, this constant is added
 * to correct the duration calculation.
 *
 * **Clock dependency:** This constant assumes PCLKB = 60 MHz (k_pclkb_hz in
 * rx72n_clock.h) and CMT2 divider = 8 (k_cmt2_divider in rx_hcsr04_hal_hw.c).
 * If either value changes, k_cmt2_wrap_us MUST be recalculated:
 *   k_cmt2_wrap_us = (65536 * 1000000) / (PCLKB / divider)
 *
 * @invariant k_cmt2_wrap_us == (65536 * 1000000) / (60000000 / 8) == 8738
 * @invariant Assumes PCLKB = 60 MHz and CMT2 divider = 8; update if clock config changes
 *
 * @code
 * // Wrap correction in get_duration:
 * if (end_us < start_us) {
 *     duration = end_us + k_cmt2_wrap_us - start_us;
 * }
 * @endcode
 *
 * @see hcsr04_hal_get_time_us_isr() Returns values that wrap at this period
 * @see rx_hcsr04_isr_get_duration() Uses this for wrap correction
 *
 * @since Version 1.0.0
 */
typedef enum : uint32_t {
  k_cmt2_wrap_us = 8738, /**< CMT2 16-bit counter wrap period in us (65536 / 7.5 MHz) */
} isr_timer_constants_t;

/* =============================================================================
 * Static Variables
 * =============================================================================
 */

/**
 * @var s_irq_state
 * @brief Per-IRQ echo measurement state (IRQ8-11 -> array indices 0-3)
 *
 * @details
 * Written by ISR (INT_IRQ8-11), read by application code (rx_hcsr04_isr_get_duration).
 * Each element corresponds to one IRQ number (index 0 = IRQ8, index 3 = IRQ11).
 * Declared volatile because fields are written in ISR context and read in task
 * context without explicit synchronization.
 *
 * @note Access pattern: ISR writes volatile fields; application reads under timeout loop
 * @warning Never access outside of rx_hcsr04_isr_start(), internal_irq_handler(),
 *          and rx_hcsr04_isr_get_duration(); direct access bypasses state validation
 *
 * @since Version 1.0.0
 */
static volatile rx_hcsr04_irq_state_t s_irq_state[k_irq_count];

/**
 * @var s_sensor_map
 * @brief Sensor index mapping table (IRQ number -> sensor array index)
 *
 * @details
 * Maps each IRQ number (0-15) to a sensor array index (0-3) or k_sensor_unused.
 * Initialized entirely to k_sensor_unused to mark all slots as unregistered.
 * Updated by rx_hcsr04_isr_register() and restored by rx_hcsr04_isr_unregister().
 *
 * **Layout:** index matches raw IRQ number (s_sensor_map[8] = Sonar 3 Back-Right)
 *
 * @note Only indices [k_irq_min..k_irq_max] (8-11) are used by HC-SR04 sensors
 * @note Indices [0..7] and [12..15] are always k_sensor_unused for HC-SR04 use
 * @warning Direct modification outside rx_hcsr04_isr_register/unregister is forbidden;
 *          use the public API to maintain consistent IRQ-to-sensor mappings
 *
 * @note Issue #336 (resolved): sensor_index is now correctly set per-sensor
 * via rx_hcsr04_config_t.sensor_index (no longer hardcoded to slot 0).
 * s_sensor_map is written with the correct index but not yet read in the ISR;
 * future work will use this mapping to dispatch per-sensor callbacks from
 * internal_irq_handler() when multi-sensor callback support is implemented.
 *
 * @since Version 1.0.0
 */
static uint8_t s_sensor_map[k_sensor_map_size] = {
  k_sensor_unused,
  k_sensor_unused,
  k_sensor_unused,
  k_sensor_unused,
  k_sensor_unused,
  k_sensor_unused,
  k_sensor_unused,
  k_sensor_unused,
  k_sensor_unused,
  k_sensor_unused,
  k_sensor_unused,
  k_sensor_unused,
  k_sensor_unused,
  k_sensor_unused,
  k_sensor_unused,
  k_sensor_unused,
};

