Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hcsr04/src/rx_hcsr04_isr.c
/* =============================================================================
 * Internal Functions
 * =============================================================================
 */

/**
 * @brief Internal IRQ handler (common logic for all IRQs)
 *
 * @details
 * Shared ISR logic called by INT_IRQ8 through INT_IRQ11. Determines edge
 * type (rising or falling) by reading GPIO pin state, then captures timestamp.
 *
 * **Algorithm:**
 * 1. Clear interrupt flag (acknowledge hardware)
 * 2. Compute array index: idx = irq_num - k_irq_min
 * 3. Check if measurement is active (ignore spurious interrupts)
 * 4. Read GPIO pin state: pin_state = (PORT0.PIDR >> idx) & k_pin_state_mask
 * 5. Rising edge (HIGH): Capture start_us timestamp
 * 6. Falling edge (LOW): Capture end_us timestamp, set complete=true, active=false
 *
 * @param[in] irq_num IRQ number (8-11)
 *
 * @return void (ISR context - no return value)
 *
 * @pre irq_num must be in range [k_irq_min, k_irq_max]
 * @pre ICU configured via rx_hcsr04_icu_configure()
 *
 * @post IR flag cleared for this vector
 * @post If active and rising edge: start_us timestamp captured
 * @post If active and falling edge: end_us captured, complete=true, active=false
 *
 * @note Called from ISR context - keep execution time minimal (< 5us)
 * @note Assumes PORT0 pins (P00-P07) map to IRQ8-15
 * @warning Do not call from task context
 *
 * @see rx_hcsr04_isr_start() Sets active=true before trigger pulse
 * @see rx_hcsr04_isr_get_duration() Reads complete flag and timestamps
 *
 * @since Version 1.0.0
 */
static void internal_irq_handler(const uint8_t irq_num)
{
  /* Step 1: Clear interrupt flag first (acknowledge hardware) */
  const uint8_t vector = k_vector_base + irq_num;

  icu()->ir[vector] = k_ir_flag_clear;

  /* Step 2: Compute state array index (IRQ8->0, IRQ9->1, ...) */
  const uint8_t idx = irq_num - k_irq_min;

  /* Step 3: Check if measurement is active (ignore spurious interrupts) */
  if (!s_irq_state[idx].active) {
    return; /* Spurious or late interrupt - ignore */
  }

  /* Step 4: Read GPIO state to determine edge type
   * P00-P07 map to IRQ8-15, so pin bit = idx = irq_num - k_irq_min */
  const bool pin_state = (bool)((port0()->pidr >> idx) & k_pin_state_mask);

  /* Step 5/6: Capture timestamp based on edge type */
  if (pin_state) {
    /* Rising edge - start of echo pulse */
    s_irq_state[idx].start_us = hcsr04_hal_get_time_us_isr();
  } else {
    /* Falling edge - end of echo pulse; mark complete before clearing active */
    s_irq_state[idx].end_us   = hcsr04_hal_get_time_us_isr();
    s_irq_state[idx].complete = true;
    s_irq_state[idx].active   = false;
  }
}

/* =============================================================================
 * Public Functions
 * =============================================================================
 */

/**
 * @brief Register HC-SR04 sensor for IRQ echo measurement
 *
 * @details
 * Maps an IRQ number to a sensor index. Validates both IRQ number range
 * and sensor_index range before storing the mapping. Used to identify
 * which sensor triggered a given interrupt.
 *
 * @param[in] irq_num      IRQ number (8-11 for P00-P03)
 * @param[in] sensor_index Sensor array index (0-3 for 4 HC-SR04 sensors)
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Registration successful
 * @retval k_rx_err_invalid_arg irq_num not in [k_irq_min, k_irq_max]
 * @retval k_rx_err_invalid_arg sensor_index >= k_hcsr04_sensor_count
 *
 * @pre IRQ configured via rx_hcsr04_icu_configure()
 * @pre sensor_index must be a valid sensor array index
 *
 * @post s_sensor_map[irq_num] updated with sensor_index
 * @post ISR can identify sensor on next interrupt
 *
 * @note Call once during sensor initialization
 * @note Not thread-safe; call during initialization only
 *
 * @see rx_hcsr04_isr_start() Arm ISR before sending trigger pulse
 *
 * @since Version 1.0.0
 */
rx_err_t rx_hcsr04_isr_register(const uint8_t irq_num, const rx_hcsr04_sensor_index_t sensor_index)
{
  /* Validate IRQ number */
  RX_CHECK_RANGE(irq_num, k_irq_min, k_irq_max, k_rx_err_invalid_arg);

  /* Validate sensor index (must be a valid sensor array index 0..k_hcsr04_sensor_count-1) */
  if ((uint8_t)sensor_index >= (uint8_t)k_hcsr04_sensor_count) {
    return k_rx_err_invalid_arg;
  }

  /* Store sensor mapping */
  s_sensor_map[irq_num] = sensor_index;

  return k_rx_ok;
}

/**
 * @brief Unregister HC-SR04 sensor from IRQ echo measurement
 *
 * @details
 * Clears the sensor mapping for the given IRQ number, restoring it to the
 * k_sensor_unused sentinel. Call this during sensor deinitialization to
 * prevent stale ISR callbacks after the sensor handle is invalidated.
 *
 * @param[in] irq_num IRQ number (8-11) to unregister
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Unregistration successful
 * @retval k_rx_err_invalid_arg irq_num not in range [8, 11]
 * @retval k_rx_err_invalid_state IRQ slot was not registered (s_sensor_map entry is k_sensor_unused)
 *
 * @pre IRQ was previously registered via rx_hcsr04_isr_register()
 * @pre No measurement currently active on this IRQ
 *
 * @post s_sensor_map[irq_num] = k_sensor_unused
 * @post ISR will ignore subsequent interrupts on this IRQ
 *
 * @note Call during sensor deinitialization, after rx_hcsr04_icu_disable()
 * @note Not thread-safe; call during single-threaded cleanup only
 *
 * @see rx_hcsr04_isr_register() Register sensor
 * @see rx_hcsr04_deinit() Calls this during cleanup in IRQ mode
 *
 * @since Version 1.0.0
 */
rx_err_t rx_hcsr04_isr_unregister(const uint8_t irq_num)
{
  RX_CHECK_RANGE(irq_num, k_irq_min, k_irq_max, k_rx_err_invalid_arg);

  /* Verify this IRQ slot was actually registered (second pre-condition check) */
  if (s_sensor_map[irq_num] == k_sensor_unused) {
    return k_rx_err_invalid_state;
  }

  s_sensor_map[irq_num] = k_sensor_unused;

  return k_rx_ok;
}

/**
 * @brief Start new echo measurement (arm ISR before sending trigger pulse)
 *
 * @details
 * Prepares ISR state for a new measurement. Validates that the IRQ is
 * registered, then sets complete=false first (to prevent a stale complete
 * flag being read), then sets active=true to allow ISR to capture edges.
 * Order matters: complete must be cleared before active is set to prevent
 * a race where ISR fires between the two writes.
 *
 * @param[in] irq_num IRQ number (8-11)
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok ISR armed successfully
 * @retval k_rx_err_invalid_arg irq_num not in valid range [k_irq_min, k_irq_max]
 * @retval k_rx_err_invalid_state irq_num slot not registered (s_sensor_map[irq_num] == k_sensor_unused)
 *
 * @pre rx_hcsr04_isr_register() called for this IRQ number
 * @pre No measurement currently active on this IRQ
 *
 * @post s_irq_state[idx].complete = false (on k_rx_ok)
 * @post s_irq_state[idx].active = true (on k_rx_ok)
 * @post ISR is armed to capture rising edge (on k_rx_ok)
 *
 * @note Always call BEFORE sending trigger pulse (ordering is critical)
 * @note complete cleared BEFORE active set (avoids race condition)
 *
 * @see rx_hcsr04_isr_get_duration() Poll for completion after this call
 *
 * @since Version 1.0.0
 */
rx_err_t rx_hcsr04_isr_start(const uint8_t irq_num)
{
  /* Validate IRQ number */
  RX_CHECK_RANGE(irq_num, k_irq_min, k_irq_max, k_rx_err_invalid_arg);

