Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hcsr04/src/rx_hcsr04_isr.c
  /* Verify IRQ is registered (second precondition check per NASA Rule 5) */
  if (s_sensor_map[irq_num] == k_sensor_unused) {
    return k_rx_err_invalid_state; /* IRQ not registered via rx_hcsr04_isr_register() */
  }

  const uint8_t idx = irq_num - k_irq_min;

  /* Clear complete BEFORE setting active to avoid stale-complete race */
  s_irq_state[idx].complete = false;
  s_irq_state[idx].active   = true;

  return k_rx_ok;
}

/**
 * @brief Disarm ISR state machine (cancel armed measurement on trigger failure)
 *
 * @details
 * Clears the active flag so the ISR will ignore subsequent edge interrupts.
 * Call this in the error path when rx_hcsr04_isr_start() succeeded but the
 * trigger pulse failed, to prevent the ISR from remaining armed indefinitely.
 *
 * @param[in] irq_num IRQ number (8-11) to disarm
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok ISR disarmed successfully
 * @retval k_rx_err_invalid_arg irq_num not in range [k_irq_min, k_irq_max]
 * @retval k_rx_err_invalid_state irq_num not registered via rx_hcsr04_isr_register()
 *
 * @pre rx_hcsr04_isr_start() called successfully for this IRQ
 * @pre irq_num registered via rx_hcsr04_isr_register() (s_sensor_map[irq_num] != k_sensor_unused)
 *
 * @post s_irq_state[idx].active = false
 * @post s_irq_state[idx].complete = false
 * @post ISR will ignore subsequent interrupts on this IRQ
 *
 * @note Best-effort cleanup; always call in error path after successful isr_start
 *
 * @see rx_hcsr04_isr_start() Arm ISR state before trigger pulse
 *
 * @since Version 1.0.0
 */
rx_err_t rx_hcsr04_isr_disarm(const uint8_t irq_num)
{
  RX_CHECK_RANGE(irq_num, k_irq_min, k_irq_max, k_rx_err_invalid_arg);

  /* Verify IRQ is registered (mirrors check in isr_start / isr_unregister) */
  if (s_sensor_map[irq_num] == k_sensor_unused) {
    return k_rx_err_invalid_state; /* IRQ not registered via rx_hcsr04_isr_register() */
  }

  const uint8_t idx         = irq_num - k_irq_min;
  s_irq_state[idx].active   = false;
  s_irq_state[idx].complete = false;

  return k_rx_ok;
}

/**
 * @brief Get echo pulse duration from ISR state
 *
 * @details
 * Reads the captured timestamps and calculates echo pulse duration.
 * Returns k_rx_err_timeout (not yet ready) if the ISR has not captured
 * both edges. On success, clears the complete flag to prepare for the
 * next measurement.
 *
 * @param[in]  irq_num     IRQ number (8-11)
 * @param[out] duration_us Pointer to store pulse duration in microseconds
 *                         (valid range: 150-8700 us for 2-150 cm in IRQ mode;
 *                          CMT2 wrap handled automatically for durations < k_cmt2_wrap_us)
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Duration available, *duration_us written, complete flag cleared
 * @retval k_rx_err_timeout Both edges not yet captured
 * @retval k_rx_err_null_ptr duration_us is NULL
 * @retval k_rx_err_invalid_arg irq_num not in [k_irq_min, k_irq_max]
 * @retval k_rx_err_range_check_failed Computed duration exceeds k_cmt2_wrap_us (invalid measurement)
 *
 * @pre rx_hcsr04_isr_start() called before trigger pulse
 * @pre ISR handlers registered in ICU (INT_IRQ8-11)
 *
 * @post On k_rx_ok: *duration_us = end_us - start_us
 * @post On k_rx_ok: complete flag cleared (ready for next measurement)
 *
 * @note Call repeatedly until k_rx_ok or caller's timeout expires
 * @note Not ISR-safe; call from task context only
 *
 * @see rx_hcsr04_isr_start() Call before sending trigger pulse
 *
 * @since Version 1.0.0
 */
rx_err_t rx_hcsr04_isr_get_duration(const uint8_t irq_num, uint32_t* const duration_us)
{
  /* Validate parameters */
  RX_CHECK_NULL_PTR(duration_us, "ISR", "duration_us is NULL");
  RX_CHECK_RANGE(irq_num, k_irq_min, k_irq_max, k_rx_err_invalid_arg);

  /* Check if measurement is complete */
  const uint8_t idx = irq_num - k_irq_min;
  if (!s_irq_state[idx].complete) {
    return k_rx_err_timeout; /* Both edges not yet captured */
  }

  /* Cache volatile ISR state into locals for consistent snapshot */
  const uint32_t start_us = s_irq_state[idx].start_us;
  const uint32_t end_us   = s_irq_state[idx].end_us;

  /* Calculate duration from captured timestamps (handle CMT2 16-bit wrap) */
  if (end_us >= start_us) {
    *duration_us = end_us - start_us;
  } else {
    /* Timer wrapped: add wrap period to correct the subtraction */
    *duration_us = end_us + k_cmt2_wrap_us - start_us;
  }

  /* Sanity check: duration must not exceed CMT2 wrap period */
  if (*duration_us > k_cmt2_wrap_us) {
    s_irq_state[idx].complete = false;
    return k_rx_err_range_check_failed;
  }

  /* Clear complete flag so next rx_hcsr04_isr_start() starts fresh */
  s_irq_state[idx].complete = false;

  return k_rx_ok;
}

/* =============================================================================
 * ISR Functions (must match vector table naming)
 * =============================================================================
 */

/**
 * @enum isr_irq_numbers_t
 * @brief Named IRQ number constants for ISR wrapper functions
 *
 * @details
 * Provides named constants for the literal IRQ numbers passed to
 * internal_irq_handler() from each ISR wrapper. Replaces magic literals
 * 8, 9, 10, 11 per the project "No Magic Numbers" policy.
 *
 * @invariant Values are fixed 8..11, matching P00..P03 pin assignments;
 *            each value must equal k_irq_min + pin_number (P0x -> IRQ(8+x))
 *
 * @code
 * // Each ISR wrapper passes its named constant to the common handler:
 * void INT_IRQ8(void)  { internal_irq_handler(k_irq_num_8);  }
 * void INT_IRQ11(void) { internal_irq_handler(k_irq_num_11); }
 * @endcode
 *
 * @see isr_constants_t Range bounds (k_irq_min, k_irq_max) and state constants
 * @see internal_irq_handler() Common ISR logic receiving these constants
 *
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_irq_num_8  = 8,  /**< IRQ8  - maps to P00 (Sonar 3 Back-Right) */
  k_irq_num_9  = 9,  /**< IRQ9  - maps to P01 (Sonar 2 Back-Left) */
  k_irq_num_10 = 10, /**< IRQ10 - maps to P02 (Sonar 1 Front-Right) */
  k_irq_num_11 = 11, /**< IRQ11 - maps to P03 (Sonar 0 Front-Left) */
} isr_irq_numbers_t;

/**
 * @brief ISR for IRQ8 (P00 - Sonar 3 Back-Right)
 *
 * @details
 * Thin wrapper that forwards IRQ number constant k_irq_num_8 to
 * internal_irq_handler(). The handler clears the IR flag, reads the GPIO
 * pin state, and captures the rising or falling edge timestamp.
 *
 * @return void
 *
 * @pre ICU configured for IRQ8 via rx_hcsr04_icu_configure() with k_hcsr04_irq_8
 * @pre Interrupts globally enabled (PSW.I = 1)
 *
 * @post IR[vector 72] flag cleared (interrupt acknowledged)
 * @post Echo edge timestamp captured in s_irq_state[0] if measurement active
 *
 * @note Thin wrapper; all logic is in internal_irq_handler()
 * @note Keep ISR execution time minimal (< 5 us)
 *
 * @see internal_irq_handler() Core ISR logic
 * @see k_irq_num_8 IRQ number constant passed to the handler
 *
 * @since Version 1.0.0
 */
void INT_IRQ8(void)
{
  internal_irq_handler(k_irq_num_8);
}

/**
 * @brief ISR for IRQ9 (P01 - Sonar 2 Back-Left)
 *
 * @details
 * Thin wrapper that forwards IRQ number constant k_irq_num_9 to
 * internal_irq_handler(). The handler clears the IR flag, reads the GPIO
 * pin state, and captures the rising or falling edge timestamp.
 *
 * @return void
 *
 * @pre ICU configured for IRQ9 via rx_hcsr04_icu_configure() with k_hcsr04_irq_9
 * @pre Interrupts globally enabled (PSW.I = 1)
 *
 * @post IR[vector 73] flag cleared (interrupt acknowledged)
 * @post Echo edge timestamp captured in s_irq_state[1] if measurement active
 *
 * @note Thin wrapper; all logic is in internal_irq_handler()
 * @note Keep ISR execution time minimal (< 5 us)
 *
 * @see internal_irq_handler() Core ISR logic
 * @see k_irq_num_9 IRQ number constant passed to the handler
 *
 * @since Version 1.0.0
 */
void INT_IRQ9(void)
{
  internal_irq_handler(k_irq_num_9);
}

/**
 * @brief ISR for IRQ10 (P02 - Sonar 1 Front-Right)
 *
 * @details
 * Thin wrapper that forwards IRQ number constant k_irq_num_10 to
 * internal_irq_handler(). The handler clears the IR flag, reads the GPIO
 * pin state, and captures the rising or falling edge timestamp.
 *
 * @return void
 *
 * @pre ICU configured for IRQ10 via rx_hcsr04_icu_configure() with k_hcsr04_irq_10
 * @pre Interrupts globally enabled (PSW.I = 1)
 *
 * @post IR[vector 74] flag cleared (interrupt acknowledged)
 * @post Echo edge timestamp captured in s_irq_state[2] if measurement active
 *
 * @note Thin wrapper; all logic is in internal_irq_handler()
 * @note Keep ISR execution time minimal (< 5 us)
 *
 * @see internal_irq_handler() Core ISR logic
 * @see k_irq_num_10 IRQ number constant passed to the handler
 *
 * @since Version 1.0.0
 */
void INT_IRQ10(void)
{
  internal_irq_handler(k_irq_num_10);
}

/**
 * @brief ISR for IRQ11 (P03 - Sonar 0 Front-Left)
 *
 * @details
 * Thin wrapper that forwards IRQ number constant k_irq_num_11 to
 * internal_irq_handler(). The handler clears the IR flag, reads the GPIO
 * pin state, and captures the rising or falling edge timestamp.
 *
 * @return void
 *
 * @pre ICU configured for IRQ11 via rx_hcsr04_icu_configure() with k_hcsr04_irq_11
 * @pre Interrupts globally enabled (PSW.I = 1)
 *
 * @post IR[vector 75] flag cleared (interrupt acknowledged)
 * @post Echo edge timestamp captured in s_irq_state[3] if measurement active
 *
 * @note Thin wrapper; all logic is in internal_irq_handler()
 * @note Keep ISR execution time minimal (< 5 us)
 *
 * @see internal_irq_handler() Core ISR logic
 * @see k_irq_num_11 IRQ number constant passed to the handler
 *
 * @since Version 1.0.0
 */
void INT_IRQ11(void)
{
  internal_irq_handler(k_irq_num_11);
}
